Repository: medo-adel/testRepo
Catalog: Common.StandardInfrastructure/Resources/Common.*.resx
Languages: ar_eg

# CannotDelete
source: Filed can't be removed
ar_eg: تغذر حذف هذا الحقل

# DateGreaterThan
source: Start date must be less than or equal end date.
ar_eg: تاريخ البداية يجب ان يكون اقل من او يساوي تاريخ النهاية

# DateInEmployeeHiringPeriod
source: Start date must be during employee hiring period.
ar_eg: تاريخ البداية يجب ان يكون داخل فترة تعين الموظف

# Delete
source: Data Deleted
ar_eg: تم الحذف

# EndDataBEforeStartDate
source: Start Date Must be less than or equal End Date
ar_eg: تاريخ بداية الفترة يجب ان يكون قبل تاريخ نهاية الفترة

# EndDateRequired
source: End date is required
ar_eg: تاريخ النهاية مطلوب

# LastStartDate
source: Start Date must be greater than start date for last operation.
ar_eg: تاريخ البداية يجب ان يكون اكبر من تاريخ بداية اخر عملية

# OperationExists
source: Data exists.
ar_eg: البيانات موجودة بالفعل

# required
source: Field Required
ar_eg: حقل مطلوب

# SDateAndEndDateOverlapWithAnother
source: Date Duration Has Overlap With Another Record
ar_eg: هذه الفترة محجوزة مسبقا او تحتوي على ايام في فترة اخرى

# Success
source: Data save successfully
ar_eg: تم الحفظ بنجاح

# Updated
source: Data Updated
ar_eg: تم التعديل

source: Admin level does not exist
ar_eg: الموقع غير موجود

source: Location does not exist
ar_eg: هذه الإدارة غير موجودة

# TimeGreaterThan
source: Start time must be less than or equal end time.
ar_eg: وقت البداية يجب ان يكون اقل من او يساوي وقت النهاية

# AssignToDailyRotatedScheduleBefore
source: Please, Delete ( Daily Rotated Schedule ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( جدول الدوامات اليومية) اولا

# AssignToEmergencyAllowanceBefore
source: Please, Delete ( Emergency Allowance ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( الإعفائات الطارئة) اولا

# AssignToEmployeeAllowanceBefore
source: Please, Delete ( Employee Allowance ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( إعفاءات الموظفين) اولا

# AssignToEmployeeBefore
source: Please, Delete ( Employee ) First.
ar_eg: من فضلك قم بالحذف الموظف اولا

# AssignToEmployeeDutyBefore
source: Please, Delete ( Employee Duty ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( دوامات الموظفين) اولا

# AssignToEmployeeFixedDutyPeriodBefore
source: Please, Delete ( Employee Fixed Duty Period ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( دوامات ثابتة فترات ) اولا

# AssignToEmployeeFullDayPermissionBefore
source: Please, Delete ( Employee Full Day Permission ) First.
ar_eg: من فضلك قم بالحذف في شاشة تصريحات يوم كامل) اولا

# AssignToEmployeeLeaveBefore
source: Please, Delete ( Employee Leave ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( أجازات الموظفين) اولا

# AssignToEmployeePermissionBefore
source: Please, Delete ( Employee Permission ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( التصريحات الجزئية للموظفين) اولا

# AssignToHolidayDateBefore
source: Please, Delete ( Holiday Date ) First.
ar_eg: من فضلك قم بالحذف في شاشة( تواريخ العطلات) اولا

# AssignToLateRegulationBefore
source: Please, Delete ( Late Regulation ) First.
ar_eg: من فضلك قم بالحذف في شاشة( حساب خصم التأخيرات) اولا

# AssignToLeaveRegulationBefore
source: Please, Delete ( Leave Regulation ) First.
ar_eg: من فضلك قم بالحذف فى شاشة( لائحة الأجازات) اولا

# AssignToLocationBefore
source: Please, Delete ( Location ) First.
ar_eg: من فضلك قم بحذف الموقع اولا

# AssignToOverTimeOrderBefore
source: Please, Delete ( OverTime Order ) First.
ar_eg: من فضلك قم بالحذف في (شاشة تعيين وقت إضافي) اولا

# AssignToPartialPermissionTypeBefore
source: Please, Delete ( Partial Permission Type ) First.
ar_eg: من فضلك قم بالحذف في شاشة( التصريحات الجزئية) اولا

# AssignToPreviousLeavesBalanceBefore
source: Please, Delete ( Previous Leaves Balance ) First.
ar_eg: من فضلك قم بالحذف في شاشة( أرصدة أجازات سابق) اولا

# AssignToTeamBefore
source: Please, Delete ( Team ) First.
ar_eg: من فضلك قم بحذف ( الفريق ) اولا

# AssignToUserBefore
source: Please, Delete ( User ) First.
ar_eg: من فضلك قم بحذف( المستخدم) اولا

# AssignToUserInqueryBefore
source: Please, Delete ( User Inquery ) First.
ar_eg: من فضلك قم بحذف المستخدم من شاشة ( مستخدمى الاستعلامات ) اولا

source: Previous Leaves Balance Is Exists
ar_eg: البيانات موجودة مسبقا

# StartDtaeMustBeGreterThanthePreviousOperation
source: Start Date must be greater than date for last operation.
ar_eg: تاريخ البداية يجب ان يكون اكبر من تاريخ اخر عملية

source: Days At Least
ar_eg: أيام على الأقل

# RequestShouldAppliedBefore
source: Request should be applied before
ar_eg: الطلب يجب أن يقدم قبل

source: RestDay and WeekendDay Should not be the same Days
ar_eg: يوم الاجازه ويوم الراحه يجب ان يكونوا مختلفين

# RequestShouldAppliedDuring
source: Request should be applied during
ar_eg: الطلب يجب ان يقدم خلال فتره

source: You must logIn first.
ar_eg: يلزم وجود بصمه دخول اولا

source: You must logout first.
ar_eg: يلزم وجود بصمه خروج اولا

# YouMustLogInAndOutFirst
source: You must logIn And logout first
ar_eg: يلزم وجود بصمه دخول وخروج اولا
